{
  "IT": [
    "Debugged and tested a multi-AI agent system for RTL code review and correction, ensuring database retrieval consistency and hardware-specific topic accuracy. Validated retrieval system behavior for FPGA-specific IP catalogs used in 10k+ interactions, improving pass@1 accuracy from 60\\% to 77\\% in Verilog generation benchmarks.",
    "Benchmarked metrics for RAG Pipeline System, increasing system efficiency by 20\\%, reducing processing time, and enhancing retrieval accuracy.",
    "Cofounded an AI voice agents startup with 2 cofounders that specialized in LLM powered agents that communicate over the phone.",
    "Engineered and validated two predictive machine learning models, achieving accuracies of 91.9\\% and 89.4\\% through hyperparameter tuning and cross-validation.",
    "Used a 100k+ financial dataset to evaluate loan approval chances based on features such as number of assets, CIBIL score, and credit score.",
    "Developed 2 award-winning apps, ScamScanner (Groq's \"Star Award\" \\& Hume AI's \"Most Socially Impactful Empathic AI Integration\" at UC Berkeley AI Hackathon) \\& Custodia AI (1st Place at AI Agents 2.0), securing spots to present at exclusive startup events \\& podcasts.",
    "Optimized facial extraction algorithms by tweaking parameters and adding pixel offsets for better orientation detection, improving accuracy by 15\\% and significantly reducing retries in the training process.",
    "Designed and released 100+ minimal iOS and Android icons from scratch using Procreate and Figma",
    "Developed, trained, \\& persisted 3 logistic regression machine learning models using Scikit-Learn that classify offensive text.",
    "Implementing efficient computer vision pipeline using MediaPipe for hand landmark detection, processing 30+ frames per second with 95\\% landmark detection accuracy.",
    "Utilized Python with pandas, scikit-learn, and TensorFlow to implement Random Forest and K-means clustering, achieving an MSE of 59.41 and R-squared of 0.996 for monthly incident predictions.",
    "Preprocessed over 50 thousand Tweets for training using Natural Language Processing (NLP) techniques using Pandas \\& NLTK.",
    "Built APIs deployed on GCP using GCS and Cloud Run, enabling seamless video-to-avatar training with a 25\\% increase in throughput and a 40\\% reduction in processing time.",
    "Spearheaded product development of a new lab workflow tool, leading to a 40\\% increase in efficiency; shadowed 10 core users, iterated on design docs, and implemented the solution with one engineer",
    "Operationalized a machine learning model to optimize police resource allocation by predicting incidents and processing a dataset of 900k+ dispatch records from the San Francisco Police Department, with the goal of reducing response times and enhancing public safety.",
    "Architecting and developing WebSocket API backend for real-time ASL translation, achieving sub-100ms latency for end-to-end processing in 5-person engineering team."
  ],
  "Product": [
    "Enhanced our flagship product's user experience that directly improved 7 million members health outcomes.",
    "Translated complex business requirements into user stories across 15 scrum teams.",
    "Mentored emerging business analyst trainees in collaboration with the Department of Labor; 100\\% offered employment.",
    "Translated business requirements into user stories across 15 scrum teams.",
    "Expanded product coverage by 700\\%; built a 10 QA contractor team to achieve this.",
    "Grew company's YouTube to 3K subscribers; produced and starred in 60+ podcasts and videos to engage users.",
    "Selected as team of 3 specialists to procure liver cells for experimental transplant therapy in children with rare liver metabolic disorders.",
    "Expanded product coverage by 7x; built a 10 QA contractor team to achieve this.",
    "Completed 2 bootcamps in software development and business analysis.",
    "Chosen as 1 of 9 for a rotation program; gained practical experience across a \\$22B revenue area.",
    "Spearheaded the first Zendesk user support team, slashing response time 40\\% with 98\\% CSAT score.",
    "Enhanced our flagship UM product user experience; positive impact on 7 million members health outcomes.",
    "Grew company YouTube to 3K subscribers; produced and starred in 60+ podcasts and videos to engage users."
  ],
  "Marketing": [],
  "Core Electronics": [],
  "Mechanical": []
}